"""
Завдання 1

Написати програму, яка переміщає всі нулі у кінець списку.

Ваше завдання — змінити список так, щоб усі нулі опинилися наприкінці списку.

Порядок ненульових чисел має зберегтися!

Приклад:

Copy code
[0, 1, 0, 12, 3] -> [1, 12, 3, 0, 0]
[0] -> [0]
[1, 0, 13, 0, 0, 0, 5] -> [1, 13, 5, 0, 0, 0, 0]
[9, 0, 7, 31, 0, 45, 0, 45, 0, 45, 0, 0, 96, 0] -> [9, 7, 31, 45, 45, 45, 96, 0, 0, 0, 0, 0, 0, 0]

Для перевірки коректності роботи Вашого коду використовуйте приклади вище.
Робити запит на введення даних від користувача не потрібно.
"""
# num_list = [0, 1, 0, 12, 3]
# my_target = 0
#
# for not_zeros in range(len(num_list)):
#   if num_list[not_zeros] != 0:
#     num_list[my_target], num_list[not_zeros] = num_list[not_zeros], num_list[my_target]
#     my_target += 1
#
# while my_target < len(num_list):
#   num_list[my_target] = 0
#   my_target += 1
#
# print(num_list)

"""
Завдання 2

Для списку цілих чисел потрібно знайти суму елементів із парними індексами [0-й, 2-й, 4-й ітд],
потім перемножити цю суму на останній елемент вхідного масиву.

Не забудьте, що перший елемент масиву має індекс 0.

Для порожнього масиву результат завжди 0.

Пояснення:

[0, 1, 7, 2, 4, 8] -> (0 + 7 + 4) * 8 = 88

Copy code
[1, 3, 5] -> 30
[6] -> 36
[] -> 0

Для перевірки коректності роботи Вашого коду використовуйте приклади вище.
Робити запит на введення даних від користувача не потрібно.

"""

my_list = [0, 1, 7, 2, 4, 8]
list_sum = 0

for number in my_list:
    if number % 2 == 0:         # num % 2 обчислює остачу від ділення числа num на 2, а == 0 перевіряє чи дорівнює отримана остача нулю
        list_sum += number

result = list_sum * my_list[-1] #-1 використовується для доступу до останнього елемента списку my_list
print(list_sum)