# Завдання 2 Перемістити елемент у списку
#
# Ваша програма має перенести останній елемент списку з кінця на початок,
# тобто, останній елемент списку має стати першим.
# Послідовність інших елементів не має змінюватися.
#
# Порожній список або список з одним елементом повинен залишитися незмінним.
#
# Кількість елементів у списку може бути будь-яким – нуль та більше!
#
# Приклади:
# [12, 3, 4, 10] => [10, 12, 3, 4]
# [1] => [1]
# [] => []
# [12, 3, 4, 10, 8] => [8, 12, 3, 4, 10]

####
# Метод	    #Опис
# append()	Додає елемент у кінець списку.
# extend()	Додає елементи зі списку в кінець іншого списку.
# insert()	Вставляє елемент по вказаному індексу.
# remove()	Видаляє елемент по вказаному індексу.
# pop()	    Повертає та видаляє елемент, присутній по вказаному індексу.
# clear()	Видаляє всі елементи зі списку.
# index()	Повертає індекс вказаного елемента.
# count()	Повертає кількість вказаних елементів у списку.
# sort()	Сортує список у порядку зростання/спадання.
# reverse()	Повертає список у зворотному порядку (“розвертає” послідовність).
# copy()	Повертає *поверхневу копію списку.

## Функція len() використовується для визначення кількості елементів у списку

########### HW 3.2 ###########
# Takes user input and splits it into a list of strings using commas as the separator
# Оператор вводить значення через кому.
# .split() розділяє введені значення в список
num_list = input("Insert numbers separated by comma: ").split(',')

if num_list:  # Перевіримо чи список не порожній
    # Видаляємо останній елемент із списку
    # Зберігаємо його в last_num variable
    last_num = num_list.pop()
    # Вставляємо last_num а початок списку (index 0)
    num_list.insert(0, last_num)
    # Додаємо решту елементів списку розділених комами
    result = ', '.join(num_list)

    print(result)
else:
    print("Empty list...")

#############